# HeavyEndPen Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..HeavyEndPen Property
ParameterTypeId Class See Also
---
"Heavy End Pen Weight"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId HeavyEndPen { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HeavyEndPen As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ HeavyEndPen {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace